Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་འདི་དང་ལྡན་པས་བསྐལ་པ་བཟང་པོ་འདིའི་སངས་རྒྱས་སྟོང་གི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ཅིང་། འདི་སྐད་དུ། ཇི་ལྟར་བྱས་ན་ངན་སོང་རྣམས་སྟོངས་པར་འགྱུར་སྙམ་པ་དང་། བདག་གི་ཉན་ཐོས་འདུས་པ་དང་པོ་ལ་ཡང་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་འབུམ་ཡོད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་འདེབས་ན། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་བྱང་ཆུབ་ནི་བསྐལ་པ་སྟོང་གིས་འགྲུབ་པར་ང་སྨྲའོ།
en: Moreover, if bodhisattvas possess such skillfulness, wish to awaken to unsurpassed and perfect buddhahood within the era of the one thousand buddhas of this excellent eon, and moreover can make aspirations such as, ‘Whatever it takes, may the lower realms be emptied,’ and ‘When my hearers first assemble, may there be billions of worthy ones,’ then, Śāradvatīputra, I promise that their awakening will be accomplished within one thousand eons.

source: །གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་སྔོ་བ་ལ་དགའ་ན་རྣམ་པ་དེ་དག་དང་། རྟགས་དེ་དག་དང་། མཚན་མ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་ལྔ་བརྒྱས་འབྱུང་བ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: By delighting in such aspirations, there will be signs, indications, and marks that they will be fulfilled within five hundred eons.

source: དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་པར་རིག་པར་བྱའོ།
en: Thus, they shall be known as nonregressing bodhisattvas.”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ན་དགའ་བར་བགྱིའོ།
en: Venerable Śāradvatīputra said, “Blessed One, when bodhisattva great beings hear this teaching on the perfections, it fills them with joy.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཡོངས་སུ་མ་བཏང་བའི་སླད་དུ་ལགས་སོ།
en: That is because they know that bodhisattvas are not abandoned by the blessed buddhas.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ནས་ཉིན་ཞག་གཅིག་ཙམ་ཡང་དགའ་བ་དང་།
en: Thus, if bodhisattva great beings hear this teaching on the perfections, they will be filled with joy and delight. Even if these feelings last for just a single day, they will cause them to enter this vehicle and remain there for a long time.

source: མཆོག་ཏུ་དགའ་བས་ཁྱབ་ཅིང་གནས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐེག་པ་ལ་ཞུགས་ནས་ཡུན་རིང་བ་ལགས་པར་རིག་པར་བགྱིའོ། །གལ་ཏེ་ཉིན་ཞག་གཉིས་ཀྱི་བར་དུ་ཁྱབ་ཅིང་གནས་ན།
en: If the joy lasts for two days, those bodhisattvas will enter the vehicle and stay there for an exceedingly long period.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཞུགས་ནས་ཤིན་ཏུ་ཡུན་རིང་བ་ལགས་པར་རིག་པར་བགྱིའོ། །གལ་ཏེ་ཉིན་ཞག་བདུན་དུ་ཡིད་དགའ་བཞིན་དུ་གནས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐེག་པ་ལ་ཞུགས་ནས་ཡུན་རིང་དུ་ལོན་པ་དག་གི་ནང་ན་ཡང་ཐེག་པ་ལ་ཞུགས་ནས།
en: If the joy lasts for seven days, those bodhisattvas will enter this vehicle and remain there for an even longer time.

source: ཆེས་ཡུན་རིང་དུ་ལོན་པ་ལགས་པར་རིག་པར་བགྱིའོ།
en: As they remain within this vehicle, they will stay there for an exceedingly long time.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན།
en: Venerable Śāradvatīputra then continued addressing the Blessed One: “Blessed One, please let me explain the meaning of what the Blessed One has taught.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གང་ཚུན་ཆད་དེའི་དགེ་བའི་རྩ་བ་ཆེར་འཕེལ་ཞིང་། དེ་ཐབས་ལ་མཁས་པར་གྱུར་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཉན་སླན་ཆད་བསྐལ་པ་བདུན་གྱིས་འབྱུང་བར་རིག་པར་བགྱི་སྟེ།
en: The roots of virtue gathered henceforth by bodhisattva great beings will thus increase greatly and, being skilled in means, they will actualize within seven eons the teachings on the perfections that they receive.

source: བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ནི། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བདག་གི་སྤོབས་པ་ལགས་སོ།
en: I have the confidence to articulate this teaching of the blessed ones on the perfections due to the blessings of the Thus-Gone One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ། དེ་དེ་བཞིན་ནོ།
en: The Blessed One said, “Śāradvatīputra, that is correct.

source: རྣམ་པ་འདི་དག་དང་། རྟགས་འདི་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཐེག་པ་ལ་ཞུགས་ནས་ཡུན་རིང་དུ་ལོན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: These signs and indications foretell that the bodhisattva great beings will enter this vehicle and remain for the entire duration.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཕྱིར་མི་ལྡོག་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: That is why those bodhisattvas are known to be nonregressing bodhisattvas.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་འཆད་པ་ན་མཆོག་ཏུ་དགའ་བ་མི་འཐོབ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: However, if bodhisattvas do not become elated when the perfections are being explained, you should understand that those bodhisattvas have only newly entered this vehicle.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉན་ཅིང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་སློབ་པ་དེ་ཡང་རིམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་ང་སྨྲའོ། །
en: Śāradvatīputra, I declare that bodhisattvas gradually attain omniscience by entering this vehicle, listening to the perfections, and then training in them.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་མ་བཏང་བ་ནི་ངོ་མཚར་ལགས་སོ།
en: Venerable Śāradvatīputra said, “Blessed One, the degree to which the blessed buddhas do not abandon the bodhisattvas is amazing!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཡོངས་སུ་མ་བཏང་སྙམ་དུ་སེམས་ན།
en: The Blessed One said, “Śāradvatīputra, tell me, do you think that it is only the bodhisattvas whom the blessed buddhas do not abandon?

source: ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་ནི་བལྟ་བར་མི་བྱའོ།
en: Śāradvatīputra, you should not think that way.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་མ་བཏང་སྟེ།
en: Because the blessed buddhas do not abandon anyone.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་འདི་ལྟར་སེམས་ཅན་འདི་དག་ཐམས་ཅད་འཁོར་བ་ན་སྤྱོད་པའི་སྡུག་བསྔལ་རྣམས་ལས་ཇི་ལྟར་ཡོངས་སུ་དགྲོལ་བར་བྱ་སྙམ་པའི་ཐུགས་ཉེ་བར་གནས་པའི་ཕྱིར་རོ།
en: Rather, they keep in their hearts a constant concern to liberate all beings from the sufferings they experience in saṃsāra.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཐུགས་ཉེ་བར་གནས་པ་དེ་བཞིན་དུ། སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཐུགས་ཉེ་བར་གནས་སོ། །
en: Śāradvatīputra, a thus-gone one is just as concerned with all beings as he is with the thus-gone ones.

source: ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་གཞན་དུ་གྱུར་ལ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་གཞན། རང་སངས་རྒྱས་རྣམས་ལ་ཡང་གཞན། དགྲ་བཅོམ་པ་རྣམས་ལ་ཡང་གཞན། ཕྱིར་མི་འོང་བ་རྣམས་ལ་ཡང་གཞན། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་ལ་ཡང་གཞན། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་ལ་ཡང་གཞན། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་ལ་ཡང་གཞན། དད་པས་རྗེས་སུ་འབྲང་བ་རྣམས་ལ་ཡང་གཞན། ཕྱི་རོལ་གྱི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་ལ་ཡང་གཞན། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པ་རྣམས་ལ་ཡང་གཞན། གཤེད་མ་རྣམས་ལ་ཡང་གཞན། གདོལ་པ་རྣམས་ལ་ཡང་ཐུགས་གཞན་ཉེ་བར་གནས་པར་གྱུར་ན་ནི།
en: Śāradvatīputra, if the Thus-Gone One discriminated in his concern for the thus-gone ones, the bodhisattvas, the solitary buddhas, the worthy ones, the non-returners, the once-returners, the stream enterers, the followers of the Dharma, the faithful ones, the non-Buddhists in possession of the five superknowledges, those who practice the path of the ten virtuous actions, and least of all with murderers and outcasts, then, Śāradvatīputra, the thus-gone, worthy, perfect Buddha would have preferences.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདུན་པས་འགྲོ་བར་འགྱུར་རོ། །ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ནི་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཐུགས་ཉེ་བར་གནས་པ་དེ་བཞིན་དུ། སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཐུགས་ཉེ་བར་གནས་ཏེ། དེའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་གནས་པའོ།
en: However, Śāradvatīputra, the Thus-Gone One is just as concerned with all beings as he is with other thus-gone ones; thus the blessed buddhas dwell within the sameness of all phenomena.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་འབྱུང་བ་དེའི་དངོས་པོའམ་དམིགས་པ་ངས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Śāradvatīputra, I do not see any entity or object that causes the Thus-Gone One to feel any attachment or anger.

source: དེ་ནི་གནས་པ་མེད་དོ།
en: In fact, there could not possibly be such a thing.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པའི་ཕྱིར་རོ།
en: Because the blessed buddhas have relinquished all attachment and anger.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མ་བཏང་ངོ་།
en: Still, Śāradvatīputra, we do say that the Thus-Gone One does not abandon bodhisattvas.

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་འདས་པའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སློབ་ཅིང་རིམ་གྱིས་འཇིག་རྟེན་དུ་ཆོས་ཀྱི་སྣང་བ་འབྱུང་བར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because the Thus-Gone One continues to train bodhisattva great beings in the six perfections and steadily spreads the light of the Dharma in the world.

source: །ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ནི་དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འདོམས་ཤིང་རྗེས་སུ་བསྟན་པར་དགོངས་སོ།
en: Śāradvatīputra, since the blessed buddhas perceive this ultimate perspective, they decide to instruct and teach the bodhisattvas.

source: །དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའ་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཡང་འཇིག་རྟེན་དུ་ཆོས་ཀྱི་སྣང་བ་འདི་འབྱུང་བར་འགྱུར་རོ།
en: Therefore, even when the Thus-Gone One passes away, bodhisattvas can still gradually awaken to unsurpassed and perfect buddhahood and spread the light of the Dharma in the world.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, that is true.

source: །བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་ཏེ།
en: Well-Gone One, that is true.

source: དེ་བཞིན་གཤེགས་པ་འདས་པའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་ཡང་ཆོས་ཀྱི་སྣང་བ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་ལགས་སོ།
en: Once the Thus-Gone One is no more, the bodhisattvas will eventually awaken to unsurpassed and perfect buddhahood and spread the light of the Dharma in the world.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། ཤིང་ལྗོན་པ་ལ་ལ་ཞིག་སྡོང་པོ་མེད་པར་གྱུར་ལ།
en: The Blessed One said, “Śāradvatīputra, think of a tree that falls over in the forest.

source: དེ་ཉིད་ལས་བྱུང་བའི་ས་བོན་ཤིང་དེའི་ཁོ་ར་ཁོར་ཡུག་ནས་སྐྱེ་ཞིང་།
en: A seed from that tree might sprout at the edge where the tree fell.

source: སྐྱེས་པ་དེ་རྣམ་པར་འཕེལ་ཞིང་རིམ་གྱིས་ས་ཕྱོགས་དེར་གྲིབ་མ་ཆེན་པོ་བྱེད་དེ། དེར་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོ་དག་ཚ་བས་གདུངས་ཤིང་། རླུང་དང་། ཉི་མ་དང་། སེར་བས་ཉེན་པ་རྣམས་གྲིབ་མ་དེ་ལ་གནས་ན་བདེ་བ་དང་ལྡན་པར་འགྱུར་ཞིང་ལུས་དང་ཡིད་བག་ཡངས་སུ་གནས་པར་འགྱུར་རོ། །
en: Gradually the tree grows and eventually develops a lush canopy where many hundreds, thousands, and even hundreds of thousands of beings can find shelter from the torments of heat, wind, sun, and hail. Sitting in the shade of that tree they feel happy and at ease.

source: གྲིབ་མ་དེ་ཡང་ཡིད་ཆགས་པར་བྱེད་པ་ཡིན་ཏེ། སྙིང་ནས་གྲིབ་མ་དེ་ལས་ཕྱིར་འགྲོ་བའི་བློ་མི་འབྱུང་ངོ་།
en: These beings come to appreciate the shade to the extent that the thought of going somewhere else never occurs to them.

source: །ཤིང་ལྗོན་པའི་སྡོང་པོ་སྔ་མ་དེ་བྱ་བ་གང་གིས་ཉེ་བར་གནས་པར་གྱུར་པའི་བྱ་བ་དེ་ཉིད་ཀྱིས་ཤིང་ལྗོན་པའི་སྡོང་པོ་ཕྱི་མ་དེ་ཡང་ཉེ་བར་གནས་པ་དེ་བཞིན་དུ།
en: Whatever functions the former tree fulfilled are now taken over by that new tree.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སློབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཉིད་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བྱ་བ་གང་གིས་ཉེ་བར་གནས་པར་གྱུར་པའི་བྱ་བ་དེ་ཉིད་བྱེད་པར་འགྱུར་ཏེ། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་སྤངས་པའི་ཕྱིར་ཡང་ཆོས་སྟོན་པར་འགྱུར་ཞིང་དེ་ལ་སེམས་ཅན་གང་དག་བློ་དང་ལྡན་པ་རྣམས་ནི་ཆོས་འདུལ་བ་དེ་ཉམས་སུ་མྱོང་བར་བྱེད་ཅིང་དེ་དག་ཆོས་འདུལ་བ་དེ་ཡོངས་སུ་གཏང་བར་མི་སེམས་སོ། །
en: Likewise, Śāradvatīputra, as the bodhisattva great beings gradually train in the six perfections and awaken to unsurpassed and perfect buddhahood within this very buddha realm, they fulfill the same functions as the other thus-gone, worthy, perfect buddhas, teaching the Dharma in order to eradicate the disturbing emotions of limitless beings. Thus, intelligent beings come to experience the Dharma and Vinaya and later have no wish to abandon that Dharma and Vinaya. “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་མི་དེ་དག་ཚ་བས་གདུངས་ཤིང་། རླུང་དང་། ཉི་མ་དང་། སེར་བས་ཉེན་ཏེ་ངལ་བ་རྣམས་ཤིང་ལྗོན་པའི་གྲིབ་མ་དེ་ཉམས་སུ་མྱོང་བ་ན་ཕྱིར་ཡོངས་སུ་གཏང་བར་མི་སེམས་པ་དེ་བཞིན་དུ། ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་བློ་དང་ལྡན་པ་གང་དག་ཡིན་པ་དེ་དག །དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་འདུལ་བ་ཐོས་ནས་བདུད་རྩིའི་རོ་ཉམས་སུ་མྱོང་བ་ན་གཞན་མུ་སྟེགས་ཅན་རྣམས་ཀྱི་གནས་སུ་འགྲོ་བར་མི་སེམས་སོ།
en: Śāradvatīputra, just as people who are plagued by the torments of heat, wind, sun, and hail have no desire to leave the shade of the tree, so, Śāradvatīputra, intelligent beings have no wish to seek out non-Buddhist teachers once they have experienced the nectar-like taste of the Dharma and Vinaya that the Thus-Gone One teaches.

source: །དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདོམས་ཤིང་རྗེས་སུ་བསྟན་པར་དགོངས་སོ།
en: It is because the blessed buddhas perceive this ultimate perspective that they decide to instruct and teach the bodhisattvas.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དེ་བཞིན་གཤེགས་པ་འདས་ཤིང་། དེ་བཞིན་གཤེགས་པ་མི་བཞུགས་པར་གྱུར་པ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འཇིག་རྟེན་གནས་པ་ལ་གྲིབ་མ་བཞིན་དུ་འགྱུར་རོ།
en: Thus, when the Thus-Gone One passes away so that no Thus-Gone One remains, the bodhisattva great beings awaken to unsurpassed and perfect buddhahood, remaining in the world and offering shade to others.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་འཚལ་བ་ལྟར་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་བརྒྱའམ།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, please allow me to explain the meaning of what the Blessed One has taught.

source: སྟོང་ངམ། བྱེ་བ་ཕྲག་འབུམ་མམ། དེ་ལས་ལྷག་པ་ཡང་རུང་བ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་པ་གང་ལགས་པ་དང་།
en: One might teach a hundred, a thousand, a trillion, or even more followers of the vehicle of the hearers and establish them in the state of a worthy one.

source: བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དག་བསྒོམ་པའི་སླད་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་གཅིག་བསྐྱེད་པ་གང་ལགས་པ་དེ་ལ་སེམས་བསྐྱེད་པ་འདི་ནི་ཆོས་བསྟན་པ་སྔ་མ་ལས་མཆོག་ཅེས་བགྱི་བ་ནས་གོང་ན་མ་མཆིས་པ་ཞེས་བགྱི་བའི་བར་དུ་སྟེ།
en: However, if one compares that Dharma teaching to bodhisattvas who just once set their mind on the state of omniscience in order to practice these perfections, then these latter ones will be supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: སེམས་བསྐྱེད་པ་འདི་ཉིད་དེ་ལས་དམ་པར་གྱུར་པ་ལགས་སོ།
en: That single occurrence of the mind of awakening would be superior.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One said to Venerable Śāradvatīputra, “Excellent, Śāradvatīputra, excellent!

source: །འདི་ལྟར་ཁྱོད་ནི་སྟོན་པའི་ཉན་ཐོས་མཁས་ཤིང་གསལ་ལ་དུལ་ཞིང་འཇིགས་པ་མེད་པ་སྟེ། ཡིད་གཞུངས་ལ།
en: As a hearer of the teacher you are learned, bright, gentle, and fearless.

source: གདམས་ངག་དང་ཚིག་བཞིན་དུ་བྱེད་པའོ།
en: You are an intelligent being who acts according to the teaching.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུས་ཇི་སྐད་བཤད་པ་བཞིན་དུ་ཁྱོད་ཀྱིས་ལོང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཟུང་ཤིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Then the Blessed One spoke to Venerable Ānanda, “Ānanda, please make sure to remember, master, and retain the elder Śāradvatīputra’s instructions on the bodhisattvas’ perfection of discipline.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བདག་གིས་བླངས་ལགས་ཏེ། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་རྣམས་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ་བདེ་བར་གཤེགས་པ་ཀུན་ཆུབ་པར་བགྱིའོ། །གཟུང་བར་བགྱིའོ། །
en: Venerable Ānanda replied to the Blessed One, “Blessed One, I will uphold this teaching on the bodhisattva great beings’ perfection of discipline and, in order that those who have newly entered this vehicle as well as all nonregressing bodhisattvas may reach the state of omniscience, Well-Gone One, I will master this teaching and remember it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་འདུས་པ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: Once the Blessed One had spoken, Venerable Śāradvatīputra, Venerable Pūrṇa Maitrāyaṇīputra, Venerable Ānanda, the great hearers, the bodhisattva great beings who had gathered from all directions, and the entire world, including its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་བདུན་པ་སྟེ་རྫོགས་སོ།།
en: This is the seventh chapter from “The Perfection of Discipline.”

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, along with a great saṅgha of 1,250 monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ། གང་པོ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ་སྤོབས་པར་གྱིས་ཤིག །
en: At that time the Blessed One said to Venerable Pūrṇa Maitrāyaṇīputra, “Pūrṇa, could you please elucidate the perfection of patience practiced by those bodhisattva great beings who seek to awaken to unsurpassed and perfect buddhahood.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་ཕ་རོལ་ལས་ངན་དུ་བརྗོད་པ་ངན་པ་འོངས་པའི་ཚིག་གི་ལམ་དང་དུ་བླང་བར་བགྱི་ཞིང་དེ་ལ་གནོད་སེམས་མི་བགྱི་སྟེ། དེ་ལ་བྱམས་པ་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: Encouraged in this way, Venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Honorable Blessed One, when bodhisattva great beings strive to awaken to unsurpassed and perfect buddhahood, they should be tolerant with those who speak harshly and negatively of them. Instead, without wishing to retaliate, they should remain loving toward them.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་གཟུང་བར་བགྱི་ཞིང་བྱམས་པའི་ཡིད་ལ་བགྱིད་པ་འབྱུང་ངོ་འཚལ་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བགྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ལགས་སོ།
en: Even though bodhisattva great beings may strive to embrace the perfection of patience and develop a loving mind in this way, it is, however, by dedicating the merit toward omniscience that they come to observe the perfection of patience.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་གང་ཡིན་པ་དང་། ཉན་ཐོས་ཀྱི་བཟོད་པ་གང་ཡིན་པ་འདི་གཉིས་ལ་ཁྱད་པར་ནི་ཅི་ཡོད་ཐ་དད་དུ་དབྱེ་བ་ནི་གང་ཡིན། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, could you please explain the differences and the distinctions between the patience of the bodhisattvas and the patience of the hearers.”

source: ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཉན་ཐོས་ཀྱི་བཟོད་པ་ནི་ཉི་ཚེ་བ་ཡིན་ལ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ནི་དཔག་ཏུ་མེད་དེ་གང་གི་ཕྱིར་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, the patience of the hearers is limited, while the patience of the bodhisattvas is boundless.

source: བདེ་བའི་ཕྱིར་གོ་ཆ་བགོས་ཤིང་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བར་བྱེད་པ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ནི་དཔག་ཏུ་མེད་པ་ཡིན་ནོ།
en: The patience of the bodhisattvas is boundless because it is aimed at accomplishing the welfare, benefit, and happiness of boundless beings. To that end they don their armor and free limitless and countless beings from suffering.

source: །ཉན་ཐོས་ཀྱི་ནི་རང་གི་རྒྱུད་ཀྱི་ཉོན་མོངས་པ་རྣམས་སྤང་བར་འདོད་པར་ཟད་པས་ན་ཚེ་དང་ལྡན་པ་དེའི་ཕྱིར་ཉན་ཐོས་ཀྱི་ནི་ཉི་ཚེ་བའི་བཟོད་པ་ཡིན་ལ། བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ནི་དཔག་ཏུ་མེད་དོ། །
en: The patience of the hearers is merely aimed at abandoning their personal disturbing emotions and therefore, Venerable One, it is a limited form of patience, while the patience of the bodhisattvas is boundless.

source: གང་དག་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ལ་གནོད་སེམས་སམ་མ་དད་པ་སྐྱེད་ཅིང་མི་བཟོད་པ་སྐྱེད་ན། དེ་དག་ནི་བསོད་ནམས་མ་ཡིན་པ་མང་དུ་སྐྱེད་པར་འགྱུར་རོ།
en: Anyone who becomes hostile, disrespectful, or impatient toward an individual who has adopted the bodhisattvas’ perfection of patience will produce a great deal of nonvirtue.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ནི་དེ་བཞིན་གཤེགས་པས་བཤུང་བ་མཛད་ཀྱང་གནོད་སེམས་མི་འབྱུང་སྟེ།
en: Venerable Śāradvatīputra, moreover, even if the Thus-Gone One were to scold bodhisattva great beings, they should not get hostile.

source: དེ་བཞིན་དུ་སེམས་ཅན་གང་དག་གདོལ་པའམ། སྨིག་མ་མཁན་ནམ། གཡུང་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྤྱོས་སམ་བརྒྱད་བཀག་ན། དེ་དག་ལ་ཡང་གནོད་སེམས་མི་བྱ་སྡང་བར་མི་བྱའོ།
en: Similarly, if they should be criticized and rebuked by people such as outcasts, bamboo workers, and those of the lower castes, they must not become hostile or angry, even at such people.

source: །གནོད་སེམས་སུ་མི་བྱེད་ཅིང་སྡང་བར་མི་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ཏེ།
en: If they can avoid becoming hostile and angry, those bodhisattva great beings will uphold the perfection of patience.

source: རིམ་གྱིས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་ཅིང་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Then they can gradually train in the perfection of patience until they finally accomplish it.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ན་ངན་པ་འོངས་པའི་ཚིག་གི་ལམ་དང་དུ་ལེན་ནུས་པར་འགྱུར་རོ།
en: If they observe the perfection of patience in this way, they become able to have patience in the face of harshly delivered words.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ། མི་ལ་ལས་ནི་ཙན་དན་གྱི་འདེ་གུས་ལུས་ལ་སྐུད་ལ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, suppose someone were to rub the body of a bodhisattva great being with sandalwood oil while another were to hurl fire at him.

source: ལ་ལས་ནི་ལུས་ལ་མེ་གཏོང་ན་མི་དེ་གཉིས་ལ་སེམས་ཇི་ལྟར་བསྐྱེད་པར་བྱ།
en: How would he feel about these two people?”
